import WeekContent from '@/components/week-content';

const WEB_PROGRAMMING_DATA = [
  {
    title: 'Intro',
    content: (
      <WeekContent
        lectureContent={[
          'جروبات الواتساب:',
          'اضغط هنا - [WhatsApp Group](https://chat.whatsapp.com/E1uQLev13e4FNKNzM9umFZ)',
          'جروب سكشن م.محمد ابراهيم : اضغط هنا - [WhatsApp Group](https://chat.whatsapp.com/EH8XSCiNFB55EXKDFVZlqn)',
        ]}
        sectionContent={[
          'لينكات الدرايف:',
          'لينك الدرايف م.ايه هشام الي فيه الاكواد [الدرايف](https://drive.google.com/drive/folders/1vWPxT_ed_q4ZCziBhWpP7efsS0SlGF5Q)',
          'لينك الدرايف م.محمد ابراهيم الي فيه اكواد السكشن [الدرايف](https://drive.google.com/drive/folders/1AwxvUMlkxbQcF5G5Kym-i38Clge5otWR?usp=sharing)',
          'لينك الدرايف م.هويدا الي فيه اكواد السكشن [الدرايف](https://drive.google.com/drive/folders/1E38jX-UijaKXj8GIGEWE3pyQ2qbkYYOt?usp=sharing)',
        ]}
      />
    ),
  },
  {
    title: 'Week 1',
    content: <WeekContent />,
  },
  {
    title: 'Week 2',
    content: (
      <WeekContent
        lectureContent={[
          'د.اسامه حلمي: شرح مقدمة عن الويب حتى صفحة 40 [لينك ملف الشرح هنا](https://drive.google.com/file/d/1TinkONoM6aX3y4_XoyOZWI_OFF7yst5s/view)',
        ]}
        sectionContent={[
          'م.اية هشام: شرحت حبة اكواد وعملت درايف للمادة هيتحط فيها من هنا ورايح كل اكواد السكشن وطريقة تنزيل البرنامج [اهو الدرايف](https://drive.google.com/drive/folders/1TinkONoM6aX3y4_XoyOZWI_OFF7yst5s/view)',
        ]}
        extraContent={[
          'م.محمد ابراهيم و م.هويدا شرحوا الاكواد الي اتخدت في المحاضره.',
          'المادة سكشنها بال vs code بحبة extensions بس',
        ]}
      />
    ),
  },
  {
    title: 'Week 3',
    content: (
      <WeekContent
        lectureContent={[
          'د.اسامه: شرح PDF حتى صفحة 58 [لينك ملف الشرح هنا](https://drive.google.com/file/d/1TinkONoM6aX3y4_XoyOZWI_OFF7yst5s/view?usp=drive_link)',
        ]}
        sectionContent={[
          'م.ايه هشام و م.محمد ابراهيم و م.هويدا : راجعوا مراجعة سريعة على اكواد سيكشن الاسبوع الي فات وكملوا شرح اكواد جديدة حتى ما وقف الدكتور في الاسليد.',
        ]}
        extraContent={[
          'لينك الدرايف م.ايه هشام الي فيه الاكواد [الدرايف](https://drive.google.com/drive/folders/1vWPxT_ed_q4ZCziBhWpP7efsS0SlGF5Q)',
          'لينك الدرايف م.محمد ابراهيم الي فيه اكواد السكشن [الدرايف](https://drive.google.com/drive/folders/1AwxvUMlkxbQcF5G5Kym-i38Clge5otWR)',
          'لينك الدرايف م.هويدا الي فيه اكواد السكشن [الدرايف](https://drive.google.com/drive/folders/1E38jX-UijaKXj8GIGEWE3pyQ2qbkYYOt)',
        ]}
      />
    ),
  },
  {
    title: 'Week 4',
    content: (
      <WeekContent
        lectureContent={[
          'د.اسامه : شرح في pdf حتي صفحه 120 [هنا](https://drive.google.com/file/d/1TinkONoM6aX3y4_XoyOZWI_OFF7yst5s/view)',
        ]}
        sectionContent={[
          'م.محمد ابراهيم: بدأ في الcss كأساس بسيط اوي تكتب الcss ازاي وكده وهيبعت [الدرايف](https://drive.google.com/drive/folders/1AwxvUMlkxbQcF5G5Kym-i38Clge5otWR?usp=sharing)' +
            ' و فيه كويز علي الhtml بس الاسبوع اللي جاي',
        ]}
        extraContent={[
          'بشمهندسة اية : الاكواد اللي شرحتها هتتبعت علي [الدرايف](https://drive.google.com/drive/folders/1vWPxT_ed_q4ZCziBhWpP7efsS0SlGF5Q)',
          'بشمهندسة هويدا: الاكواد اللي شرحتها هتتبعت علي [الدرايف](https://drive.google.com/drive/folders/1E38jX-UijaKXj8GIGEWE3pyQ2qbkYYOt)',
          'لينك الدرايف م.ايه هشام الي فيه الاكواد [الدرايف](https://drive.google.com/drive/folders/1vWPxT_ed_q4ZCziBhWpP7efsS0SlGF5Q)',
          'لينك الدرايف م.محمد ابراهيم الي فيه أكواد السكشن [الدرايف](https://drive.google.com/drive/folders/1AwxvUMlkxbQcF5G5Kym-i38Clge5otWR)',
          'لينك الدرايف م.هويدا الي فيه أكواد السكشن [الدرايف](https://drive.google.com/drive/folders/1E38jX-UijaKXj8GIGEWE3pyQ2qbkYYOt)',
        ]}
      />
    ),
  },
  {
    title: 'Week 5',
    content: (
      <WeekContent
        lectureContent={[
          'د.اسامه : خلص css حتي اسليد 158 والمره الجايه مراجعة على ما سبق',
        ]}
        sectionContent={[
          'م.محمد ابراهيم : عمل كويز لكل المجموعات الي معاه بس والمره الجايه هيكمل شرح.',
          ' م.اية هشام : شرحت iframe , form , special character وهترفع تاسك على الدرايف وهيتسلم في الاسبوع العاشر والكويز الخاص بيها في الاسبوع العاشر برضو',
        ]}
        extraContent={['م.هويدا : في كويز علي HTML لكل الجروبات الي معاها.']}
      />
    ),
  },
];

const AI_DATA = [
  {
    title: 'Intro',
    content: (
      <WeekContent
        lectureContent={[
          'المادة سكشنها بال Python',
          'جروب المحاضرات للكل: [اضغط هنا](https://chat.whatsapp.com/Got9szj0M4MIVk0S0spTC0)',
        ]}
        sectionContent={[
          'لينك تيمز محاضرات لكل الجروبات وهيترفع عليه ماتريال المادة فخش بالذوق يمحترم: [اضغط هنا](https://teams.microsoft.com/l/team/19%3AS-Z7eGJG2IP4-sPe0dmhpZsyrSl6nO8vnw30iH4eT5c1%40thread.tacv2/conversations?groupId=74d1a1f5-9708-4dc3-a2eb-2e68a6245e1d&tenantId=9241132d-c810-4da1-bc3a-a00f714767c4)',
        ]}
      />
    ),
  },
  {
    title: 'Week 1',
    content: <WeekContent />,
  },
  {
    title: 'Week 2',
    content: (
      <WeekContent
        lectureContent={[
          'د.دينا: شرحت اول شابتر كامل و [واهو اللينك](#)',
          'د.سارة:شرحت اول محاضرة و [واهو اللينك](#)',
          'وخلي بالك يا غالي وركز معايا كده دكتورة سارة ودكتورة دينا طلبوا اننا هنعمل تيمات وهنعمل بريزنتيشين لا يقل عن الست سلايدات ولا يزيد عن العشر سلايدات هيكون البريزنتيشين عليه خمس درجات+الدكاترة قالوا انهم ناويين يضيفوا ده في الفاينال',
          'طب اعمل عن ايه؟؟ المواضيع اللي جوا الدايرة الخضراء في [اللينك ده](#) من [اللينك ده](#)',
        ]}
        sectionContent={[
          'ايمان عبد الله:شرحت مقدمة عن أساسيات بايثون و الفايل ده كامل',
          'ايمان عبدالهادي:شرحت أساسيات بايثون و حلت أمثلة والفايل ده كامل',
          'نبيل: شرح أساسيات بايثون كاملة و من ضمنهم built in function بتوع الdictionary و lists',
        ]}
      />
    ),
  },
  {
    title: 'Week 3',
    content: (
      <WeekContent
        lectureContent={['د.دينا: خلصت شابتر 2', 'د.سارة: خلصت شابتر 2']}
        sectionContent={[
          'م.ايمان عبدالهادي: كملت شرح اساسيات بايثون الفايل ده',
          'م.ايمان عبدالله: كملت شرح اساسيات بايثون الدرايف ده عليه كل سكاشن البشمهندسة',
          'نبيل: شرح كود BFS وDFS',
        ]}
      />
    ),
  },
  {
    title: 'Week 4',
    content: (
      <WeekContent
        lectureContent={[
          'د.دينا: خلصت شابتر 3',
          'د.سارة: خلصت شابتر 3',
          'ركز معايا دكتورة دينا ودكتورة سارة طلبوا الشيت ده وانه يتسلم في السكاشن',
        ]}
        sectionContent={[
          'م.ايمان عبدالهادي: شرحت الفايل ده',
          'م.ايمان عبدالله:الفايل ده',
          'م. نبيل: مفيش جديد',
        ]}
      />
    ),
  },
  {
    title: 'Week 5',
    content: (
      <WeekContent
        lectureContent={[
          'د.دينا: خلصت شابتر 4',
          'د.سارة: خلصت شابتر 4',
          'ركز معايا دكتورة دينا ودكتورة سارة طلبوا ان كل الجروبات في سكاشنهم يمتحنوا وهيبعتوا تاسك جديد يتسلم في السكاشن',
        ]}
        sectionContent={[
          'كل السكاشن فيهااااااااااااا كويزااااااااات علي المحاضرة',
          'م.ايمان عبدالهادي: شرحت الاكواد دول  ده و ده و ده',
          'م.ايمان عبدالله:شرحت الاكواد دول  ده و ده و ده',
          'م.شيماء:شرحت الاكواد دول  ده و ده وده',
          'م.اماني:شرحت الاكواد دول  ده و ده و ده',
        ]}
      />
    ),
  },
];

const DIGITAL_ART = [
  {
    title: 'جروبات الوتساب',
    content: (
      <WeekContent
        lectureContent={[
          '# جروبات الوتساب :',
          'جروب المحاضرات اضغط هنا',
          'جروب م.ندي : اضغط هنا',
        ]}
        sectionContent={[]}
      />
    ),
  },
  {
    title: 'Week 1',
    content: (
      <WeekContent
        lectureContent={['# Lectures', 'no lecture this week']}
        sectionContent={['# Section', 'no section this week']}
      />
    ),
  },
  {
    title: 'Week 2',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور ايمن:مشرحش حاجة ومدخلش',
          'دكتورة شيرين:شرحت نظام الدرجات وادت مقدمة بسيطة جدا وهي المقدمة ,و توزيعة الدرجات',
        ]}
        sectionContent={[
          '# Section',
          'م.ندي:مشرحتش حاجة',
          'م.اية هشام:شرحت حبة اكواد وعملت درايف للمادة هيتحط فيها من هنا ورايح كل اكواد السكشان وطريقة تنزيل البرنامج اهو الدرايف',
          'المادة سكشنها بال java نزل netbeans',
        ]}
      />
    ),
  },
  {
    title: 'Week 3',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور ايمن:شرح input output devices ومقدمة عن المادة وبعت لينك هيتحط عليه كل المحاضرات لاخر السنة اهو',
          'دكتورة شيرين:شرحت الفايل ده كامل',
        ]}
        sectionContent={[
          '# Section',
          'م.ندى : مفيش جديد',
          'م.شيماء : مفيش جديد',
          'م.اية هشام : شرحت حبة ازاي ترسم مستطيل سواء فاضي او مليان الوان صورة الاكواد هنا ولسة هتنزل الفايل بتاع الاكواد هنا اهو الدرايف',
        ]}
      />
    ),
  },
  {
    title: 'Week 4',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور ايمن: كل محاضرات الدكتور هنا',
          'دكتورة شيرين:شرحت شابتر ده',
        ]}
        sectionContent={[
          '# Section',
          'م.شيماء : مفيش تاسكات اوكويزات',
          'م.اية هشام : ازاي ترسم دايرة لسة هتنزل الفايل بتاع الاكواد هنا اهو الدرايف',
        ]}
      />
    ),
  },
  {
    title: 'Week 5',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور ايمن:شرح lec 5 اصبر لما ينزل هنا',
          'دكتورة شيرين:شرحت lec 5  لسة هتبعتها و حلت شيت لسة هتبعته',
        ]}
        sectionContent={[
          '# Section',
          'م.ندى : طلبت التاسك ده مطبوع و التاسك ده علي الموبايل عادي',
          'م.شيماء :طلبت تاسك تعمل كورة متحركة',
          'م.اية هشام : السكشن اللي جاي في السكاشن هتعمل تيمات اقصي عدد ليها تلاتة علشان خمس درجات بتوع تفاعل السكاشن و الاكواد لسة هتنزل اهو الدرايف',
        ]}
      />
    ),
  },
];

const DIGITAL_SIGNALS = [
  {
    title: 'جروبات الوتساب',
    content: (
      <WeekContent
        lectureContent={[
          '# جروبات الوتساب :',
          'جروب المحاضرات د.أميرة : اضغط هنا',
          'سيكشن  G5 م.نيره : اضغط هنا',
        ]}
        sectionContent={[]}
      />
    ),
  },
  {
    title: 'Week 1',
    content: (
      <WeekContent
        lectureContent={['# Lectures', 'no lecture this week']}
        sectionContent={['# Section', 'no section this week']}
      />
    ),
  },
  {
    title: 'Week 2',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.اميره : شرحت مقدمة عن المنهج',
          'يعني ايه signal وخصائصها . pdf الشرح هنا',
        ]}
        sectionContent={[
          '# Section',
          'لم يتم شرح سكاشن وخدوا الغياب فقط .',
          'وهنشتغل في السكاشن بي Matlab',
        ]}
      />
    ),
  },
  {
    title: 'Week 3',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.أميرة مع جروب 2 : كملت جزء الشرح الي يعتبر تأسيس للبدايه في الكورس DSP',
          'ومن المره الجايه هنبدا في الكورس',
          'وشرحت في المحاضره :',
          'ازاي بنعمل sampling لي signal',
          'و انواع بعض  signalذي impulse signal و unite signal',
          'باقي الجروبات:شرحت شابتر 2 وشابتر 3',
        ]}
        sectionContent={[
          '# Section',
          'م.ساره شبل : شرحت  الفايل ده',
          'م.شيماء : شرحت مسائل عن signal',
          'م.نيره : شرحت جزء matlab وبعتت ليه pdf و لينك شرح',
          'وفي تاسك هيتسلم لينك التاسك : هنا',
        ]}
      />
    ),
  },
  {
    title: 'Week 4',
    content: (
      <WeekContent
        lectureContent={['# Lectures', 'د.أميرة : شرحت الفايل ده شابتر 4']}
        sectionContent={[
          '# Section',
          'م.ساره شبل : طلبت التاسك ده وشرحت الاكواد دي',
          'م.شيماء : مفيش تاسك',
          'م.نيره : راجعت علي القديم بس',
        ]}
      />
    ),
  },
  {
    title: 'Week 5',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.أميرة : خلصت شابتر 4 لينك الشابتر هنا',
          'وشرحت مقدمه بسيطه لي شابتر 5',
        ]}
        sectionContent={[
          '# Section',
          'في كويز لكل المجموعات الاسبوع الجاي علي الي اتاخد في السكاشن',
          'م.شيماء : شرحت مسأله نظري وقالت هنطبقها عملي المره',
          'الجايه علي MATLAB',
          'م.ساره شبل : مدخلتش لي جروب 6',
          'شرحت في جروب 2 حتي unit ramp',
          'وباقي الجروبات شرحت عادي ودا pdf الي شرحت منه هنا',
          'م.نيره : شرحت Quantization .. وهتبعت تاسك واكواد علي الجروب',
        ]}
      />
    ),
  },
];

const COMPUTER_SCIENCE_TOPICS = [
  {
    title: 'موضوعات مختارة',
    content: (
      <WeekContent
        lectureContent={['المادة سكشنها بال python']}
        sectionContent={[
          '# جروبات الوتساب :',
          'جروب المحاضرات  : اضغط هنا',
          'جروب سيكشن G2 : اضغط هنا',
          'جروب سيكشن G5 : اضغط هنا',
          'جروب سيكشن G6 : اضغط هنا',
          'جروب  م.سمر G4 : اضغط هنا',
          'جروب  م.سمر و م. ياسمين G4 : اضغط هنا',
        ]}
      />
    ),
  },
  {
    title: 'Week 1',
    content: (
      <WeekContent
        lectureContent={['# Lectures', 'no lecture this week']}
        sectionContent={['# Section', 'no section this week']}
      />
    ),
  },
  {
    title: 'Week 2',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.بسنت : شرحت اول شابتر',
          'د.مدحت : شرح اول شابتر',
          'شابتر وان هنا',
        ]}
        sectionContent={[
          '# Section',
          'مفيش شرح في الأسبوع دا',
          'وهنشتغل Python  في السكاشن',
        ]}
      />
    ),
  },
  {
    title: 'Week 3',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.بسنت : شرحت شابتر 2 حتي صفحه 51',
          'لينك شابتر 2 : هنا',
        ]}
        sectionContent={[
          '# Section',
          'م.سمر : حليت اول سؤالين في السكشن من دا الشيت والباقي تاسك …. ',
          'ودا حل الشيت هنا',
          'وحلت تاني صفحه في pdf دا  والباقي تاسك هيتسلم',
          'وطلبت تاسك هيتسلم   لينك التاسك',
          'م. كارين : حليت شيت في السكشن الشيت  …. ودا حل الشيت هنا',
          'وطلبت تاسك هيتسلم   لينك التاسك',
          'م.ياسمين : حليت شيت في السكشن الشيت  …. ودا حل الشيت هنا',
          'وطلبت تاسك هيتسلم   لينك التاسك',
        ]}
      />
    ),
  },
  {
    title: 'Week 4',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.بسنت : شرحت شابتر 2 حتي صفحه 76',
          'لينك شابتر 2 : هنا',
        ]}
        sectionContent={[
          '# Section',
          'م.سمر :  طلبت اول سؤالين تاسك في الفايل ده و وحلت جزء من الفايل ده و ده الحل',
          'م. كارين :  طلبت اول سؤالين تاسك في الفايلين دول ده',
          'م.ياسمين : طلبت اول سؤالين تاسك في الفايلين دول الاول   و  الثاني وحله كمااان اهو يعم ده الحل و اللي مسلمش التاسك اللي اتطلب في الاسبوع التالت يجيبه',
        ]}
      />
    ),
  },
  {
    title: 'Week 5',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'د.بسنت : شرحت ال matrix لسة هتبعت الفايل',
          'د.مدحت: شرح ch3',
        ]}
        sectionContent={[
          '# Section',
          'لكل المعيدين اخر ميعاد تسليم التاسكات الاسبوع اللي جاي قبل الميد طب ايه التاسكات كلها؟',
          'شابتر 1 مطلوب ليه : Assignment 1 و Lab 1',
          'شابتر 2 مطلوب ليه : Assignment 2 و Lab 2',
        ]}
      />
    ),
  },
];

const OPERATING_SYSTEM_THEORIES = [
  {
    title: 'نظريات نظم التشغيل',
    content: (
      <WeekContent
        lectureContent={[
          'click here  لينك ازاي تنزل Ubuntu 24.04 LTS in VirtualBox المادة سكشنها بال',
        ]}
        sectionContent={[
          '# جروبات الوتساب :',
          'جروب المحاضرات دكتور محمد الشرقاوي: اضغط هنا',
          'جروب المحاضرات دكتور تامر:اضغط هنا',
          'سكشن جروب واحد كامل:اضغط هنا',
          'سكاشن بشمهندسة نورهان كلها:اضغط هنا',
          'سكشن جروب اتنين بشمهندسة سمر:اضغط هنا',
          'سكشن جروب 3 كامل:اضغط هنا',
        ]}
      />
    ),
  },
  {
    title: 'Week 1',
    content: (
      <WeekContent
        lectureContent={['# Lectures', 'no lecture this week']}
        sectionContent={['# Section', 'no section this week']}
      />
    ),
  },
  {
    title: 'Week 2',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور تامر:شرح جزء من الفايل ده و هيخلصه المرة اللي جاية',
          'دكتور محمد الشرقاوي:شرح اغلب الفايل ده لحد سلايد 15',
        ]}
        sectionContent={[
          '# Section',
          'لم يتم شرح سكاشن من اي معيد و لكن طلبوا تنزيل بس البرنامج',
          'لينك ازاي تنزل Ubuntu 24.04 LTS in VirtualBox    بclick here',
        ]}
      />
    ),
  },
  {
    title: 'Week 3',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور تامر:خلص الفايل ده',
          'دكتور محمد الشرقاوي:خلص الفايل ده وشرح فايل خمس صفح من الفايل ده',
        ]}
        sectionContent={[
          '# Section',
          'م.سمر:شرحت الفايل ده',
          'م.اماني:لسة البشمهندسة هتبعت الاسلايدات ومفيش تاسكات',
          'م.نورهان: شرحت الفايل ده',
          'م.ابرار: شرحت الفايل ده',
        ]}
      />
    ),
  },
  {
    title: 'Week 4',
    content: (
      <WeekContent
        lectureContent={['# Lectures', 'دكتور محمد الشرقاوي:خلص الفايل ده']}
        sectionContent={[
          '# Section',
          'م.سمر:اكواد السكشن',
          'م.اماني:اكواد السكشن',
          'م.نورهان:اكواد السكشن و طلبت تاسك تكتب كل الأوامر ووظيفتها في ورقة، الاوامر اللي اتاخدت السيكشن اللي فات والسيكشن ده مع أمر vi',
          'م.ابرار: اكواد السكشن',
        ]}
      />
    ),
  },
  {
    title: 'Week 5',
    content: (
      <WeekContent
        lectureContent={[
          '# Lectures',
          'دكتور محمد الشرقاوي:شرح لحد سلايد 16 شابتر تلاتة',
        ]}
        sectionContent={[
          '# Section',
          'كل المعيدييييييين فيه كويز معاهم',
          'م.سمر:اكواد السكشن',
          'م.اماني:اكواد السكشن',
          'م.نورهان:اكواد السكشن',
          'م.ابرار:اكواد السكشن',
        ]}
      />
    ),
  },
];

const NEWS = [
  {
    quote: '📢 في كويز في الإشارات الرقمية الأسبوع الجاي، ذاكروا كويس! 📚',
  },
  {
    quote: '⚠️ كويز برمجة الويب كمان الأسبوع الجاي، استعدوا! 💻',
  },
  {
    quote: '📝 كويز الذكاء الاصطناعي الأسبوع الجاي، خلّوا بالكم! 🤖',
  },
  {
    quote: '⏳ كويز نظم التشغيل الأسبوع الجاي، ذاكروا بتركيز! 🖥️',
  },

  {
    quote: '📢 امتحان الميد تيرم بعد أسبوعين! 📚',
  },
];

export {
  DIGITAL_ART,
  DIGITAL_SIGNALS,
  COMPUTER_SCIENCE_TOPICS,
  OPERATING_SYSTEM_THEORIES,
  WEB_PROGRAMMING_DATA,
  AI_DATA,
  NEWS,
};
